{"id":1543,"date":"2022-07-13T17:03:36","date_gmt":"2022-07-13T17:03:36","guid":{"rendered":"https:\/\/onpsilverhomes.com\/?page_id=1543"},"modified":"2022-07-13T17:03:37","modified_gmt":"2022-07-13T17:03:37","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/onpsilverhomes.com\/terms-of-use\/","title":{"rendered":"Terms of Use"},"content":{"rendered":"\n<h2>1. Terms<\/h2>\n\n\n\n<p>By accessing this Website, accessible from https:\/\/onpsilverhomes.com, you are agreeing to be bound by these Website Terms and Conditions of Use and agree that you are responsible for the agreement with any applicable local laws. If you disagree with any of these terms, you are prohibited from accessing this site. The materials contained in this Website are protected by copyright and trade mark law.<\/p>\n\n\n\n<h2>2. Use License<\/h2>\n\n\n\n<p>Permission is granted to temporarily download one copy of the materials on Silver Homes Website for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license you may not:<\/p>\n\n\n\n<ul><li>modify or copy the materials;<\/li><li>use the materials for any commercial purpose or for any public display;<\/li><li>attempt to reverse engineer any software contained on Silver Homes Website;<\/li><li>remove any copyright or other proprietary notations from the materials; or<\/li><li>transferring the materials to another person or “mirror” the materials on any other server.<\/li><\/ul>\n\n\n\n<p>This will let Silver Homes to terminate upon violations of any of these restrictions. Upon termination, your viewing right will also be terminated and you should destroy any downloaded materials in your possession whether it is printed or electronic format.<\/p>\n\n\n\n<h2>3. Disclaimer<\/h2>\n\n\n\n<p>All the materials on Silver Homes Website are provided “as is”. Silver Homes makes no warranties, may it be expressed or implied, therefore negates all other warranties. Furthermore, Silver Homes does not make any representations concerning the accuracy or reliability of the use of the materials on its Website or otherwise relating to such materials or any sites linked to this Website.<\/p>\n\n\n\n<h2>4. Limitations<\/h2>\n\n\n\n<p>Silver Homes or its suppliers will not be hold accountable for any damages that will arise with the use or inability to use the materials on Silver Homes Website, even if Silver Homes or an authorize representative of this Website has been notified, orally or written, of the possibility of such damage. Some jurisdiction does not allow limitations on implied warranties or limitations of liability for incidental damages, these limitations may not apply to you.<\/p>\n\n\n\n<h2>5. Revisions and Errata<\/h2>\n\n\n\n<p>The materials appearing on Silver Homes Website may include technical, typographical, or photographic errors. Silver Homes will not promise that any of the materials in this Website are accurate, complete, or current. Silver Homes may change the materials contained on its Website at any time without notice. Silver Homes does not make any commitment to update the materials.<\/p>\n\n\n\n<h2>6. Links<\/h2>\n\n\n\n<p>Silver Homes has not reviewed all of the sites linked to its Website and is not responsible for the contents of any such linked site. The presence of any link does not imply endorsement by Silver Homes of the site. The use of any linked website is at the user’s own risk.<\/p>\n\n\n\n<h2>7. Site Terms of Use Modifications<\/h2>\n\n\n\n<p>Silver Homes may revise these Terms of Use for its Website at any time without prior notice. By using this Website, you are agreeing to be bound by the current version of these Terms and Conditions of Use.<\/p>\n\n\n\n<h2>8. Your Privacy<\/h2>\n\n\n\n<p>Please read our Privacy Policy.<\/p>\n\n\n\n<h2>9. Governing Law<\/h2>\n\n\n\n<p>Any claim related to Silver Homes Website shall be governed by the laws of in without regards to its conflict of law provisions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>1. Terms By accessing this Website, accessible from https:\/\/onpsilverhomes.com, you are agreeing to be bound by these Website Terms and Conditions of Use and agree that<span class=\"excerpt-hellip\"> […]<\/span><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"om_disable_all_campaigns":false,"_mi_skip_tracking":false},"_links":{"self":[{"href":"https:\/\/onpsilverhomes.com\/wp-json\/wp\/v2\/pages\/1543"}],"collection":[{"href":"https:\/\/onpsilverhomes.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/onpsilverhomes.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/onpsilverhomes.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/onpsilverhomes.com\/wp-json\/wp\/v2\/comments?post=1543"}],"version-history":[{"count":1,"href":"https:\/\/onpsilverhomes.com\/wp-json\/wp\/v2\/pages\/1543\/revisions"}],"predecessor-version":[{"id":1544,"href":"https:\/\/onpsilverhomes.com\/wp-json\/wp\/v2\/pages\/1543\/revisions\/1544"}],"wp:attachment":[{"href":"https:\/\/onpsilverhomes.com\/wp-json\/wp\/v2\/media?parent=1543"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}